historic/moonshot-samples/C9N1/mixed-305-1to4k_120Mseq.fio.out
randread-1k-4k: (g=0): rw=randread, bs=1K-4K/1K-4K/1K-4K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 3 processes

randread-1k-4k: (groupid=0, jobs=1): err= 0: pid=30733: Fri May 27 18:05:49 2016
  read : io=5173.4MB, bw=88290KB/s, iops=42568, runt= 60001msec
    slat (usec): min=1, max=5583, avg= 7.57, stdev=20.38
    clat (usec): min=1, max=155468, avg=225.11, stdev=904.09
     lat (usec): min=25, max=155493, avg=232.84, stdev=904.97
    clat percentiles (usec):
     |  1.00th=[   80],  5.00th=[   96], 10.00th=[  107], 20.00th=[  123],
     | 30.00th=[  137], 40.00th=[  151], 50.00th=[  163], 60.00th=[  177],
     | 70.00th=[  195], 80.00th=[  215], 90.00th=[  338], 95.00th=[  524],
     | 99.00th=[ 1048], 99.50th=[ 1352], 99.90th=[ 2960], 99.95th=[10048],
     | 99.99th=[47360]
    bw (KB  /s): min=  333, max=130722, per=41.69%, avg=88057.75, stdev=26443.04
    lat (usec) : 2=0.01%, 4=0.01%, 20=0.01%, 50=0.07%, 100=6.45%
    lat (usec) : 250=79.29%, 500=8.94%, 750=2.88%, 1000=1.25%
    lat (msec) : 2=0.95%, 4=0.08%, 10=0.03%, 20=0.02%, 50=0.02%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=15.09%, sys=41.19%, ctx=407326, majf=0, minf=19
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=2554130/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=30734: Fri May 27 18:05:49 2016
  read : io=7204.0MB, bw=122940KB/s, iops=120, runt= 60004msec
    slat (usec): min=71, max=2280, avg=295.12, stdev=90.25
    clat (usec): min=360, max=179368, avg=3519.54, stdev=12386.10
     lat (usec): min=659, max=179648, avg=3815.06, stdev=12392.16
    clat percentiles (usec):
     |  1.00th=[  572],  5.00th=[  588], 10.00th=[  604], 20.00th=[  628],
     | 30.00th=[  644], 40.00th=[  660], 50.00th=[  684], 60.00th=[  716],
     | 70.00th=[  756], 80.00th=[  836], 90.00th=[ 3824], 95.00th=[16768],
     | 99.00th=[68096], 99.50th=[89600], 99.90th=[148480], 99.95th=[177152],
     | 99.99th=[179200]
    bw (KB  /s): min=98771, max=159085, per=58.25%, avg=123037.46, stdev=6134.21
    lat (usec) : 500=0.12%, 750=69.38%, 1000=13.49%
    lat (msec) : 2=3.86%, 4=3.30%, 10=2.61%, 20=3.46%, 50=1.76%
    lat (msec) : 100=1.86%, 250=0.15%
  cpu          : usr=0.13%, sys=3.86%, ctx=13739, majf=0, minf=525
  IO depths    : 1=90.8%, 2=1.2%, 4=2.3%, 8=5.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=7204/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=30735: Fri May 27 18:05:49 2016
  write: io=7203.0MB, bw=122937KB/s, iops=120, runt= 59997msec
    slat (usec): min=82, max=26771, avg=331.57, stdev=334.06
    clat (usec): min=403, max=179764, avg=4698.95, stdev=14761.63
     lat (usec): min=796, max=180181, avg=5031.00, stdev=14777.78
    clat percentiles (usec):
     |  1.00th=[  684],  5.00th=[  724], 10.00th=[  756], 20.00th=[  796],
     | 30.00th=[  828], 40.00th=[  860], 50.00th=[  900], 60.00th=[  948],
     | 70.00th=[ 1012], 80.00th=[ 1128], 90.00th=[ 5536], 95.00th=[22912],
     | 99.00th=[78336], 99.50th=[91648], 99.90th=[138240], 99.95th=[166912],
     | 99.99th=[179200]
    bw (KB  /s): min=90887, max=141660, per=100.00%, avg=123024.68, stdev=4845.10
    lat (usec) : 500=0.04%, 750=9.14%, 1000=59.66%
    lat (msec) : 2=15.34%, 4=4.53%, 10=3.55%, 20=2.26%, 50=1.90%
    lat (msec) : 100=3.39%, 250=0.19%
  cpu          : usr=0.80%, sys=3.59%, ctx=13549, majf=0, minf=9
  IO depths    : 1=88.2%, 2=1.7%, 4=3.3%, 8=6.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=7203/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=12377MB, aggrb=211225KB/s, minb=88289KB/s, maxb=122940KB/s, mint=60001msec, maxt=60004msec
  WRITE: io=7203.0MB, aggrb=122937KB/s, minb=122937KB/s, maxb=122937KB/s, mint=59997msec, maxt=59997msec

Disk stats (read/write):
  nvme0n1: ios=2616881/64809, merge=0/0, ticks=638080/272484, in_queue=910816, util=97.16%